config.org
#+TITLE: Emacs Config

* About
This is my personal Emacs configuration using =basemacs= at its core. All code here is tangled, it creates: =early-init.el=, =init.el=, and various "modules" in the =lisp/= directory.
* Startup
#+begin_src emacs-lisp :lexical t :tangle init.el
  ;;; init.el --- -*- lexical-binding: t -*-
#+end_src

Add the =lisp/= directory to the =load-path= so we can load =basemacs-core=, modules, and any other custom lisp code.
#+begin_src emacs-lisp :lexical t :tangle init.el
  (add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))
#+end_src

Load the base config.
#+begin_src emacs-lisp :lexical t :tangle init.el
  (require 'basemacs-core)
#+end_src

Set up the leader keys
#+begin_src emacs-lisp :lexical t :tangle init.el
  (use-package emacs
    :init
    (defconst basemacs-leader "SPC")
    (defconst basemacs-local-leader "SPC m"))
#+end_src
* Modules
Here is where the magic happens. Let's load some modules!
#+begin_src emacs-lisp :lexical t :tangle init.el
  ;; emacs
  (require 'kpav-evil)
  (require 'kpav-selectrum)
  (require 'kpav-ui)
  (require 'kpav-windows-and-buffers)
  (require 'kpav-org)
  ;; tools
  (require 'kpav-project)
  (require 'kpav-git)
  (require 'kpav-vterm)
  ;; code
  (require 'kpav-lsp)
  (require 'kpav-php)
  (require 'kpav-elisp)
  (require 'kpav-clojure)
  (require 'kpav-common-lisp)
  (require 'kpav-js)
#+end_src
This approach requires a bit more code than having this file just tangle to =init.el=, but I like the ability to easily turn on/off things for tinkering and debugging purposes.
* Emacs
Things that modify Emacs stuff.
** Evil Mode
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-evil.el
  ;;; kpav-evil.el --- -*- lexical-binding: t -*-
#+end_src

Evil mode is vim in emacs! Using =undo-fu= here instead of =undo-tree= as I have found that =undo-fu= seems to be quicker and less buggy than =undo-tree=.
#+begin_src emacs-lisp :tangle lisp/kpav-evil.el
  (use-package evil
    :straight t
    :init
    (use-package undo-fu :straight t)
    :custom
    (evil-want-keybinding nil)  ;; evil-collection assumes this
    (evil-undo-system 'undo-fu)
    :config
    (evil-mode +1)
    ;; turn on Emacs keybinds in evil mode
    (setq evil-insert-state-map (make-sparse-keymap))
    (define-key evil-insert-state-map (kbd "<escape>") 'evil-normal-state))
#+end_src
The bit about using Emacs keybinds in evil mode is from https://stackoverflow.com/questions/25542097/emacs-evil-mode-how-to-change-insert-state-to-emacs-state-automatically

Use evil keys in various modes..
#+begin_src emacs-lisp :tangle lisp/kpav-evil.el
  (use-package evil-collection
    :straight t
    :after evil
    :config
    (evil-collection-init))
#+end_src

surround.vim emulation.
#+begin_src emacs-lisp :tangle lisp/kpav-evil.el
  (use-package evil-surround
    :straight t
    :after evil
    :config
    (global-evil-surround-mode +1))
#+end_src

vim-commentary emulation
#+begin_src emacs-lisp :tangle lisp/kpav-evil.el
  (use-package evil-commentary
    :straight t
    :config
    (evil-commentary-mode +1))
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-evil.el
  (provide 'kpav-evil)
  ;;; kpav-evil.el ends here
#+end_src
** UI
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-ui.el
  ;;; kpav-ui.el --- -*- lexical-binding: t -*-
#+end_src
*** Fonts
Set up fonts, this is mainly for use in =variable-pitch-mode=.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-ui.el
  (use-package faces
    :straight nil
    :init
    ;; Main typeface
    (set-face-attribute 'default nil :family "Iosevka" :height 130)
    ;; Proportionately spaced typeface
    (set-face-attribute 'variable-pitch nil :family "EtBembo" :height 1.0)
    ;; Monospaced typeface
    (set-face-attribute 'fixed-pitch nil :family "Iosevka" :height 1.0))
#+end_src
*** Modus Theme
#+begin_quote
Accessible themes for GNU Emacs, conforming with the highest standard for colour contrast between background and foreground values (WCAG AAA)
#+end_quote

Modus themes are readable, clean looking, and super customizable. It also works very well with Org mode and Variable Pitch.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-ui.el
  (use-package modus-themes
    :straight t
    :init
    (setq modus-themes-mixed-fonts t
          modus-themes-bold-constructs t
          modus-themes-italic-constructs t
          modus-themes-intense-markup t
          modus-themes-completions 'opinionated
          modus-themes-subtle-line-numbers t
          modus-themes-syntax '(faint alt-syntax)
          modus-themes-paren-match '(bold intense underline)
          modus-themes-region '(accented bg-only no-extend)
          ;; org specific settings
          modus-themes-org-blocks 'grayscale
          modus-themes-headings '((t . rainbow))
          modus-themes-scale-headings t)
    (modus-themes-load-themes)
    :config
    (modus-themes-load-vivendi))
#+end_src
*** Variable Pitch
=variable-pitch-mode= allows us to have multiple fonts in a single buffer. This is useful for =org-mode= which can have prose, code, and other things, in the same file.

Turn =variable-pitch-mode= on for =org-mode=.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-ui.el
  (use-package face-remap
    :straight nil
    :ghook
    ('org-mode-hook #'variable-pitch-mode))
#+end_src
*** Modeline
Set up for =doom-modeline=. Nice looking modeline that plays well with evil and lots of other stuff.

You need to run =M-x all-the-icons-install-fonts= to get the fancy fonts in the modeline

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-ui.el
  (use-package all-the-icons
    :straight t
    :defer t)
#+end_src

=column-number-mode= displays the cursors current line on the modeline
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-ui.el
  (use-package doom-modeline
    :straight t
    :demand t
    :preface
    :init
    (column-number-mode +1)
    (doom-modeline-mode +1)
    :custom
    (doom-modeline-vcs-max-length 50)
    (doom-modeline-buffer-file-name-style 'truncate-upto-project))
#+end_src
*** Rainbow Delimiters
Add rainbow delimiters in all programming language modes
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-ui.el
  (use-package rainbow-delimiters
    :straight t
    :ghook
    ('prog-mode-hook #'rainbow-delimiters-mode))
#+END_SRC
*** EOF
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-ui.el
  (provide 'kpav-ui)
  ;;; kpav-ui.el ends here
#+end_src
** Windows and Buffers
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-windows-and-buffers.el
  ;;; kpav-windows-and-buffers.el --- -*- lexical-binding: t -*-
#+end_src
*** Keys
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-windows-and-buffers.el
  (use-package window
    :straight nil
    :general
    (base-leader-def
     :states 'normal
     "b" '(:ignore t :wk "buffers")
     "w" '(:ignore t :wk "windows")
     ;; "bb" 'switch-to-buffer
     "bb" 'consult-buffer
     "bk" 'kill-buffer
     "wo" 'split-window-horizontally
     "wu" 'split-window-vertically
     "wd" 'delete-window))
#+end_src
*** Windmove
Windmove provides a way to move around emacs windows.

Default keybindings are: ~S-arrowkey~ (e.g. ~S-Left~) to move around
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-windows-and-buffers.el
  (use-package windmove
    :straight nil
    :general
    (base-leader-def
     :states 'normal
     "wh" 'windmove-left
     "wj" 'windmove-down
     "wk" 'windmove-up
     "wl" 'windmove-right)
    :config
    (windmove-default-keybindings))
#+end_src
*** EOF
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-windows-and-buffers.el
  (provide 'kpav-windows-and-buffers)
  ;;; kpav-windows-and-buffers.el ends here
#+end_src
** Org Mode
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-org.el
  ;;; kpav-org.el --- -*- lexical-binding: t -*-
#+end_src

- Use evil way of closing and quitting (=:q= =:x=) when editing code in org mode
- Define some keys
- Disable the checkdock check because most of my elisp code is in snippets in this config
  
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-org.el
  (use-package org
    :straight t
    :general
    (org-src-mode-map
     [remap evil-save-and-close] 'org-edit-src-exit
     [remap evil-save-modified-and-close] 'org-edit-src-exit
     [remap evil-quit] 'org-edit-src-abort)
    (base-leader-def
     :states 'normal
     "a" 'org-agenda)
    (base-local-leader-def
     :keymaps 'org-mode-map
     :states 'normal
     "b" 'org-babel-tangle)
    :preface
    (defun my-disable-flycheck-for-elisp ()
      (setq flycheck-disabled-checkers '(emacs-lisp-checkdoc)))
    :gfhook
    ('org-src-mode-hook #'my-disable-flycheck-for-elisp)
    :custom
    (org-agenda-files (list "~/org/agenda/")))
#+end_src

Install =org-contrib=
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-org.el
  (use-package org-contrib
    :straight t)
#+end_src

Prettify headings and lists with =org-superstar-mode=
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-org.el
  (use-package org-superstar
    :straight t
    :ghook
    ('org-mode-hook (lambda () (org-superstar-mode +1))))
#+end_src
*** EOF
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-org.el
  (provide 'kpav-org)
  ;;; kpav-org.el ends here
#+end_src
** Selectrum & Co.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-selectrum.el
  ;;; kpav-selectrum.el --- -*- lexical-binding: t -*-
#+end_src
Set up Selectrum and various packages that play well with it.
*** Selectrum
Selectrum is a narrowing/completion system similiar to Ivy.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-selectrum.el
  (use-package selectrum
    :straight t
    :demand t
    :ghook
    'after-init-hook)
#+end_src

#+begin_quote
Filter and sort results ... by frecency (a combination of frequency and recency).
#+end_quote
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-selectrum.el
  (use-package prescient
    :straight t
    :after selectrum
    :config
    (prescient-persist-mode +1))

  (use-package selectrum-prescient
    :straight t
    :after (selectrum prescient)
    :init
    (selectrum-prescient-mode +1))
#+end_src
*** ctrlf
#+begin_quote
a from scratch redesigned buffer-search interface
#+end_quote
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-selectrum.el
  (use-package ctrlf
    :straight t
    :general
    (evil-normal-state-map "/" 'ctrlf-forward-default)
    :init
    (ctrlf-mode +1))
#+end_src
*** Marginalia
Marginalia adds information to the completions provided by Selectrum (keybinds, info about command, etc.)
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-selectrum.el
  (use-package marginalia
    :straight t
    :general
    ("M-A" 'marginalia-cycle)
    (:keymaps
     'minibuffer-local-map
     "M-A" 'marginalia-cycle)
    :init
    (marginalia-mode +1))
#+end_src
