lisp/kpav-selectrum.el
;;; kpav-selectrum.el --- -*- lexical-binding: t -*-

(use-package selectrum
  :straight t
  :demand t
  :ghook
  'after-init-hook)

(use-package prescient
  :straight t
  :after selectrum
  :config
  (prescient-persist-mode +1))

(use-package selectrum-prescient
  :straight t
  :after (selectrum prescient)
  :init
  (selectrum-prescient-mode +1))

(use-package ctrlf
  :straight t
  :general
  (evil-normal-state-map "/" 'ctrlf-forward-default)
  :init
  (ctrlf-mode +1))

(use-package marginalia
  :straight t
  :general
  ("M-A" 'marginalia-cycle)
  (:keymaps
   'minibuffer-local-map
   "M-A" 'marginalia-cycle)
  :init
  (marginalia-mode +1))
