config.org
*** Consult
#+begin_quote
Consult provides practical commands based on the Emacs completion function completing-read.
#+end_quote
Keys copied from projects README.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-selectrum.el
  (use-package consult
    :straight t
    :general
    ;; C-c bindings (mode-specific-map)
    ("C-c h" 'consult-history)
    ("C-c m" 'consult-mode-command)
    ("C-c b" 'consult-bookmark)
    ("C-c k" 'consult-kmacro)
    ;; C-x bindings (ctl-x-map)
    ("C-x M-:" 'consult-complex-command)     ;; orig. repeat-complex-command
    ("C-x b" 'consult-buffer)                ;; orig. switch-to-buffer
    ("C-x 4 b" 'consult-buffer-other-window) ;; orig. switch-to-buffer-other-window
    ("C-x 5 b" 'consult-buffer-other-frame)  ;; orig. switch-to-buffer-other-frame
    ;; Custom M-# bindings for fast register access
    ("M-#" 'consult-register-load)
    ("M-'" 'consult-register-store)          ;; orig. abbrev-prefix-mark (unrelated)
    ("C-M-#" 'consult-register)
    ;; Other custom bindings
    ("M-y" 'consult-yank-pop)                ;; orig. yank-pop
    ("<help> a" 'consult-apropos)            ;; orig. apropos-command
    ;; M-g bindings (goto-map)
    ("M-g e" 'consult-compile-error)
    ("M-g f" 'consult-flycheck)              ;; Alternative: consult-flycheck
    ("M-g g" 'consult-goto-line)             ;; orig. goto-line
    ("M-g M-g" 'consult-goto-line)           ;; orig. goto-line
    ("M-g o" 'consult-outline)               ;; Alternative: consult-org-heading
    ("M-g m" 'consult-mark)
    ("M-g k" 'consult-global-mark)
    ("M-g i" 'consult-imenu)
    ("M-g I" 'consult-imenu-multi)
    ;; M-s bindings (search-map)
    ("M-s f" 'consult-find)
    ("M-s F" 'consult-locate)
    ("M-s g" 'consult-grep)
    ("M-s G" 'consult-git-grep)
    ("M-s r" 'consult-ripgrep)
    ("M-s l" 'consult-line)
    ("M-s L" 'consult-line-multi)
    ("M-s m" 'consult-multi-occur)
    ("M-s k" 'consult-keep-lines)
    ("M-s u" 'consult-focus-lines)
    ;; Isearch integration
    ("M-s e" 'consult-isearch)
    (:keymaps
     'isearch-mode-map
     "M-e" 'consult-isearch                 ;; orig. isearch-edit-string
     "M-s e" 'consult-isearch               ;; orig. isearch-edit-string
     "M-s l" 'consult-line                  ;; needed by consult-line to detect isearch
     "M-s L" 'consult-line-multi)           ;; needed by consult-line to detect isearch
    :init
    ;; Optionally configure the register formatting. This improves the register
    ;; preview for `consult-register', `consult-register-load',
    ;; `consult-register-store' and the Emacs built-ins.
    ;; (setq register-preview-delay 0
    ;;       register-preview-function #'consult-register-format)

    ;; Optionally tweak the register preview window.
    ;; This adds thin lines, sorting and hides the mode line of the window.
    ;; (advice-add #'register-preview :override #'consult-register-window)

    ;; Optionally replace `completing-read-multiple' with an enhanced version.
    ;; (advice-add #'completing-read-multiple :override #'consult-completing;; -read-multiple)

    ;; Use Consult to select xref locations with preview
    ;; (setq xref-show-xrefs-function #'consult-xref
    ;;       xref-show-definitions-function #'consult-xref)
    :config
    ;; projectile
    ;; (setq consult-project-root-function #'projectile-project-root)
    ;; project.el
    (setq consult-project-root-function
          (lambda ()
            (when-let (project (project-current))
              (car (project-roots project))))))
#+end_src
*** EOF
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-selectrum.el
  (provide 'kpav-selectrum)
  ;;; kpav-selectrum.el ends here
#+end_src
* Tools
Add and configure some additional tools.
** Git
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-git.el
  ;;; kpav-git.el --- -*- lexical-binding: t -*-
#+end_src
*** git-gutter-fringe
Add git change icons in the fringe, e.g. when somethings been added, changed, or removed. Modus themes makes this look decent.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-git.el
  (use-package git-gutter-fringe
    :straight t
    :config
    (global-git-gutter-mode +1)
    (setq-default fringes-outside-margins t))
#+end_src
*** git-timemachine
Go through commit history on a file.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-git.el
  (use-package git-timemachine
    :straight t
    :defer t)
#+end_src
*** EOF
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-git.el
  (provide 'kpav-git)
  ;;; kpav-git.el ends here
#+end_src
** Projects
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-project.el
  ;;; kpav-project.el --- -*- lexical-binding: t -*-
#+end_src
*** project.el
Built in project interaction.

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-project.el
  (use-package project
    :straight nil
    :general
    (base-leader-def
     :states 'normal
     "p" '(:ignore t :wk "projects")
     "pf" 'project-find-file
     "pg" 'consult-ripgrep
     "pG" 'consult-git-grep))
#+end_src
*** COMMENT Projectile
Projectile provides some nice ways of interacting with projects.

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-project.el
  (use-package projectile
    :straight t
    :init
    (use-package ripgrep :straight t)
    :general
    (base-leader-def
     :states 'normal
     "p" '(:ignore t :wk "projects")
     "pf" 'projectile-find-file
     "pd" 'projectile-find-dir
     "pb" 'projectile-switch-to-buffer
     "pp" 'projectile-switch-project
     "pg" 'projectile-ripgrep)
    :config
    (projectile-mode +1))
#+end_src
*** Treemacs
Treemacs provides a nice file explorer for projects.

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-project.el
  (use-package treemacs
    :straight t
    :defer t
    :general ([f8] 'treemacs))

  (use-package treemacs-evil
    :straight t
    :after (evil treemacs))

  ;; (use-package treemacs-projectile
  ;;   :straight t
  ;;   :after (projectile treemacs))

  (use-package treemacs-magit
    :straight t
    :after (treemacs))
#+end_src
*** EOF
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-project.el
  (provide 'kpav-project)
  ;;; kpav-project.el ends here
#+end_src
** Terminal
*** vterm
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-vterm.el
  ;;; kpav-vterm.el --- -*- lexical-binding: t -*-
#+end_src

This provides a terminal emulator powered by libvterm. It is essentially a full terminal emulator.

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-vterm.el
  (use-package vterm
    :straight t)
#+end_src

Open multiple vterms. Evil configuration from it's README.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-vterm.el
  (use-package multi-vterm
    :straight t
    :general
    (base-leader-def
     :states 'normal
     "t" '(:ignore t :wk "term")
     "tt" 'multi-vterm
     "tn" 'multi-vterm-next
     "tp" 'multi-vterm-prev)
    :gfhook #'evil-insert-state
    :config
    (define-key vterm-mode-map [return]                      #'vterm-send-return)
    (setq vterm-keymap-exceptions nil)
    (evil-define-key 'insert vterm-mode-map (kbd "C-e")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-f")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-a")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-v")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-b")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-w")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-u")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-d")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-n")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-m")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-p")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-j")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-k")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-r")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-t")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-g")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-c")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-SPC")    #'vterm--self-insert)
    (evil-define-key 'normal vterm-mode-map (kbd "C-d")      #'vterm--self-insert)
    (evil-define-key 'normal vterm-mode-map (kbd ",c")       #'multi-vterm)
    (evil-define-key 'normal vterm-mode-map (kbd ",n")       #'multi-vterm-next)
    (evil-define-key 'normal vterm-mode-map (kbd ",p")       #'multi-vterm-prev)
    (evil-define-key 'normal vterm-mode-map (kbd "i")        #'evil-insert-resume)
    (evil-define-key 'normal vterm-mode-map (kbd "o")        #'evil-insert-resume)
    (evil-define-key 'normal vterm-mode-map (kbd "<return>") #'evil-insert-resume))
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-vterm.el
  (provide 'kpav-vterm)
  ;;; kpav-vterm.el ends here
#+end_src
* Code
Things that modify coding stuff (mostly programming langs and LSP).
