config.org
** LSP
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-lsp.el
  ;;; kpav-lsp.el --- -*- lexical-binding: t -*-
#+end_src

Setup for Microsoft's (GASP!) Language Server Protocol. Any language that uses this calls =lsp= in the language mode's =:hook= / =:ghook=

#+BEGIN_QUOTE
The Language Server Protocol (LSP) defines the protocol used between an editor or IDE and a language server that provides language features like auto complete, go to definition, find all references etc.
#+END_QUOTE

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-lsp.el
  (use-package lsp-mode
    :straight t
    :gfhook
    #'lsp-enable-which-key-integration
    :commands lsp
    :custom
    (lsp-completion-provider :capf)
    (lsp-keymap-prefix "C-l"))

  (use-package lsp-ui
    :straight t
    :commands lsp-ui-mode)

  (use-package lsp-treemacs
    :straight t
    :commands lsp-treemacs-errors-list)

  (use-package dap-mode
    :straight t
    :defer t)
#+end_src

Some handy links
- https://emacs-lsp.github.io/lsp-mode/page/performance/
  
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-lsp.el
  (provide 'kpav-lsp)
  ;;; kpav-lsp.el ends here
#+end_src
** Lisps
*** Shared
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-lisp-core.el
  ;;; kpav-lisp-core.el --- -*- lexical-binding: t -*-
#+end_src

Lisps can share a lot of the same config code due to the nature of the syntax.

List of all lisp mode hooks. This is used to enable modes for all of them.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-lisp-core.el
  (defconst my-lisp-mode-hooks
    '(lisp-mode-hook
      sly-mrepl-mode-hook
      emacs-lisp-mode-hook
      clojure-mode-hook
      cider-repl-mode-hook))
#+end_src

Lispy provides vim-like commands to navigate and edit Lisp code.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-lisp-core.el
  (use-package lispy
    :straight t
    :ghook my-lisp-mode-hooks)
#+end_src

Automatically indent code.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-lisp-core.el
  (use-package aggressive-indent
    :straight t
    :ghook my-lisp-mode-hooks)
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-lisp-core.el
  (provide 'kpav-lisp-core)
  ;;; kpav-lisp-core.el ends here
#+end_src
*** Clojure
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-clojure.el
  ;;; kpav-clojure.el --- -*- lexical-binding: t -*-
  (require 'kpav-lisp-core)
#+end_src

Use LSP with all clojure-related modes.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-clojure.el
  (use-package clojure-mode
    :straight t
    :defer t
    :ghook
    ('clojure-mode-hook #'lsp)
    ('clojurec-mode-hook #'lsp)
    ('clojurescript-mode #'lsp)
    :custom
    (lsp-enable-indentation nil))
  ;; is this needed?
  ;; :config
  ;; (dolist (m '(clojure-mode
  ;;              clojurec-mode
  ;;              clojurescript-mode
  ;;              clojurex-mode))
  ;;   (add-to-list 'lsp-language-id-configuration `(,m . "clojure")))
#+end_src

Cider provides a Clojure REPL for Emacs.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-clojure.el
  (use-package cider
    :straight t
    :after clojure-mode
    :ghook
    ('cider-repl-mode-hook #'rainbow-delimiters-mode)
    :general
    (base-local-leader-def
     :states 'normal
     :keymaps
     'clojure-mode-map
     "r" 'cider
     "n" 'cider-repl-set-ns
     "er" 'cider-eval-region
     "eb" 'cider-eval-buffer
     "ef" 'cider-eval-sexp-at-point
     "el" 'cider-eval-last-sexp))
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-clojure.el
  (provide 'kpav-clojure)
  ;;; kpav-clojure.el ends here
#+end_src
*** Common Lisp
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-common-lisp.el
  ;;; kpav-common-lisp.el --- -*- lexical-binding: t -*-
  (require 'kpav-lisp-core)
#+end_src

Sly provides a Common Lisp REPL for Emacs.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-common-lisp.el
  (use-package sly
    :straight t
    :defer t
    :ghook
    ('sly-mrepl-mode-hook #'rainbow-delimiters-mode)
    :general
    (base-local-leader-def
     :states 'normal
     :keymaps 'lisp-mode-map
     "eb" 'sly-eval-buffer
     "el" 'sly-eval-last-expression
     "ed" 'sly-eval-defun
     "er" 'sly-eval-region)
    :custom
    (inferior-lisp-program "/usr/bin/sbcl"))

  (use-package sly-quicklisp
    :straight t
    :after sly)

  (use-package sly-asdf
    :straight t
    :after sly)
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-common-lisp.el
  (provide 'kpav-common-lisp)
  ;;; kpav-common-lisp.el ends here
#+end_src
*** Emacs Lisp
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-elisp.el
  ;;; kpav-elisp.el --- -*- lexical-binding: t -*-
  (require 'kpav-lisp-core)
#+end_src

Set up keys for evaling elisp.
#+BEGIN_src emacs-lisp :lexical t :tangle lisp/kpav-elisp.el
  (use-package emacs
    :straight nil
    :general
    (base-local-leader-def
     :states 'normal
     :keymaps 'emacs-lisp-mode-map
     "e" '(:ignore t :wk "eval")
     "eb" 'eval-buffer
     "el" 'eval-last-sexp
     "ed" 'eval-defun
     "er" 'eval-region)
    (base-local-leader-def
     :states 'normal
     :keymaps 'lisp-interaction-mode-map
     "e" '(:ignore t :wk "eval")
     "eb" 'eval-buffer
     "el" 'eval-last-sexp
     "ed" 'eval-defun
     "er" 'eval-region))
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-elisp.el
  (provide 'kpav-elisp)
  ;;; kpav-elisp.el ends here
#+end_src
** PHP
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-php.el
  ;;; kpav-php.el --- -*- lexical-binding: t -*-
#+end_src

I use PHP for my job, so I need to use the =WellspringCodingStandard=.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-php.el
  (use-package php-mode
    :straight t
    :mode "\\.php\\'"
    :gfhook #'my-php-setup
    :general
    (general-define-key
     :keymaps 'php-mode-map
     "C-c a" 'my/align-php-dbl-arrow)
    :custom
    ;; align -> on successive lines
    (php-lineup-cascaded-calls t)
    (flycheck-phpcs-standard "WellspringCodingStandard"))
#+end_src

Setup the default coding style and LSP for php. Need to set =lsp-enable-file-watchers= to nil because the project has a large amount of files and it causes performance issues.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-php.el
  (defun my-php-setup ()
    (php-enable-default-coding-style)
    (setq lsp-enable-file-watchers nil)
    (lsp))
#+end_src

Align the ==>= in arrays
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-php.el
  (defun my/align-php-dbl-arrow ()
    "Align the => in arrays."
    (interactive)
    (align-regexp
     (region-beginning) (region-end)
     "\\(\\s-*\\) => " 1 0 nil))
#+end_src

Use =PHP_CodeSniffer= to format files
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-php.el
  (use-package phpcbf
    :straight t
    :after (php-mode)
    :custom
    (phpcbf-executable "/usr/local/bin/phpcbf")
    (phpcbf-standard "WellspringCodingStandard"))
#+end_src

=psysh= is a php repl
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-php.el
  (use-package psysh
    :straight t
    :defer t)
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-php.el
    (provide 'kpav-php)
    ;;; kpav-php.el ends here
#+end_src
** JavaScript / TypeScript
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-js.el
  ;;; kpav-js.el --- -*- lexical-binding: t -*-
#+end_src
*** JavasScript
Using the built in =js-mode=. This handles both vanilla js and =.jsx=.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-js.el
  (use-package js-mode
    :straight nil
    :mode "\\.js\\'"
    :interpreter "node"
    :gfhook
    #'lsp)
#+end_src
*** TypeScript
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-js.el
  (use-package typescript-mode
    :straight t
    :mode "\\.ts\\'"
    :commands (typescript-mode)
    :gfhook
    #'lsp)
#+end_src
*** JSON
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-js.el
  (use-package json-mode
    :straight t
    :mode "\\.json\\'")
#+end_src
*** EOF
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-js.el
  (provide 'kpav-js)
  ;;; kpav-js.el ends here
#+end_src
* EOF
#+begin_src emacs-lisp :lexical t :tangle init.el
  (provide 'init)
  ;;; init.el ends here
#+end_src
* TODO To Do List
** TODO Emacs bindings in evil mode
** TODO Test JS / TS stuff more
** TODO Add JS REPL (skewer?)
** TODO Add keys for LSP
jumping and stuff
** TODO Add Hydra
Should probably be in =basemacs-core=
** TODO Add keys for files, M-x, C-x?
** TODO Add Embark?
Looks like its useful with selectrum and co.?
** TODO Look into Selectrum and co. config more
See what other settings there are
** TODO Replace this with current config!
** TODO Look into TabNine / company-tabnine
AI completion engine?
